---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExportPatternTable
source: html/dfe6ed05-4e0e-6cb9-01fa-fe21d4124ee0.htm
---
# ExportPatternTable Methods

Inserts a (key,info) pair into Export pattern table.